[
  {
    "lang_key":
    {
      "id":"text01",
      "ENG": "Web & Game Developer",
      "ESP": "Desarrollador Web y de Videojuegos",
      "CAT": "Desenvolupador Web i de Videojocs"
    }
  },
  {
    "lang_key":
    {
      "id":"text02",
      "ENG": "A fan of video games, rock, manga and card games (TCG's), it motivates me to get involved in projects and feel integrated into them and in the team. I consider myself a calm person who thinks calmly and logically, although I find it difficult to make decisions when I am alone.",
      "ESP": "Fan de los videojuegos, el rock, el manga y los juegos de cartas (TCG's), me motiva implicarme en proyectos, sentirme integrado en ellos y en el equipo. Me considero una persona tranquila que piensa de forma calmada y lógica, aunque me cuesta tomar decisiones cuando estoy solo.",
      "CAT": "Fan dels videojocs, el rock, el manga i els jocs de cartes (TCG's), em motiva implicar-me en projectes i sentir-me integrat en ells i en l'equip. Em considero una persona tranquil·la que pensa de forma calmada i lògica, encara que em costa prendre decisions quan estic sol."
    }
  },
  {
    "lang_key":
    {
      "id":"text03",
      "ENG": "TECH SKILLS",
      "ESP": "HABILIDADES TÉCNICAS",
      "CAT": "HABILITATS TÈCNIQUES"
    }
  },
  {
    "lang_key":
    {
      "id":"text04",
      "ENG": "Developing Languages:",
      "ESP": "Lenguajes de programación:",
      "CAT": "Llenguatges de programació:"
    }
  },
  {
    "lang_key":
    {
      "id":"text05",
      "ENG": "Softwares:",
      "ESP": "Programas:",
      "CAT": "Programes:"
    }
  },
  {
    "lang_key":
    {
      "id":"text06",
      "ENG": "Frameworks:",
      "ESP": "Entornos de trabajo:",
      "CAT": "Entorn de treball:"
    }
  },
  {
    "lang_key":
    {
      "id":"text07",
      "ENG": "SOFT SKILLS",
      "ESP": "COMPETENCIAS",
      "CAT": "COMPETÈNCIES"
    }
  },
  {
    "lang_key":
    {
      "id":"text08",
      "ENG": "Mathematical reasoning",
      "ESP": "Razonamiento matemático",
      "CAT": "Raonament matemàtic"
    }
  },
  {
    "lang_key":
    {
      "id":"text09",
      "ENG": "Analysis and resolution of problems",
      "ESP": "Análisis y resolución de problemas",
      "CAT": "Anàlisi i resolució de problemes"
    }
  },
  {
    "lang_key":
    {
      "id":"text10",
      "ENG": "Technology orientation",
      "ESP": "Orientación a la tecnología",
      "CAT": "Orientació a la tecnologia"
    }
  },
  {
    "lang_key":
    {
      "id":"text11",
      "ENG": "Motivation",
      "ESP": "Motivación",
      "CAT": "Motivació"
    }
  },
  {
    "lang_key":
    {
      "id":"text12",
      "ENG": "Interest in learning",
      "ESP": "Interés en aprender",
      "CAT": "Interès per aprendre"
    }
  },
  {
    "lang_key":
    {
      "id":"text13",
      "ENG": "Self-control",
      "ESP": "Autocontrol",
      "CAT": "Autocontrol"
    }
  },
  {
    "lang_key":
    {
      "id":"text14",
      "ENG": "PROFESSIONAL EXPERIENCE",
      "ESP": "EXPERIENCIA PROFESIONAL",
      "CAT": "EXPERIÈNCIA PROFESSIONAL"
    }
  },
  {
    "lang_key":
    {
      "id":"text15",
      "ENG": "Junior Game Developer:",
      "ESP": "Desarrollador junior de videojuegos:",
      "CAT": "Desenvolupador junior de videojocs:"
    }
  },
  {
    "lang_key":
    {
      "id":"text16",
      "ENG": "Game Developing using Unity Engine & C#",
      "ESP": "Programación de videojuegos utilizando Unity Engine y C#",
      "CAT": "Programació de videojocs utilitzant Unity Engine i C#"
    }
  },
  {
    "lang_key":
    {
      "id":"text17",
      "ENG": "Gameplay & Client Developing.",
      "ESP": "Desarrollo de Gameplay y cliente.",
      "CAT": "Desenvolupament de Gameplay i client."
    }
  },
  {
    "lang_key":
    {
      "id":"text19",
      "ENG": "Programming Teacher:",
      "ESP": "Profesor de programación:",
      "CAT": "Professor de programació:"
    }
  },
  {
    "lang_key":
    {
      "id":"text20",
      "ENG":"Teacher of extracurricular classes of primary oriented to video games.",
      "ESP": "Profesor de clases extraescolares de primaria orientadas a videojuegos.",
      "CAT": "Professor de classes extraescolars de primària orientades a videojocs"
    }
  },
  {
    "lang_key":
    {
      "id":"text21",
      "ENG": "Pla de l'abella school",
      "ESP": "Escuela Pla de l'abella",
      "CAT": "Escola Pla de l'abella"
    }
  },
  {
    "lang_key":
    {
      "id":"text22",
      "ENG": "ACADEMIC TRAINING",
      "ESP": "ESTUDIOS",
      "CAT": "ESTUDIS"
    }
  },
  {
    "lang_key":
    {
      "id":"text23",
      "ENG": "FrontEnd Developing BootCamp [490h]",
      "ESP": "Curso de Programación FrontEnd [490h]",
      "CAT": "Curs de Programació FrontEnd [490h]"
    }
  },
  {
    "lang_key":
    {
      "id":"text24",
      "ENG": "Bit Academy, Barcelona, Spain",
      "ESP": "Academia Bit, Barcelona, España",
      "CAT": "Academia Bit, Barcelona, Espanya"
    }
  },
  {
    "lang_key":
    {
      "id":"text25",
      "ENG": "Videogame Design & Production Degree",
      "ESP": "Diseño y Producción de Videojuegos",
      "CAT":  "Disseny i Producció de Videojocs"
    }
  },
  {
    "lang_key":
    {
      "id":"text26",
      "ENG": "TecnoCampus, Mataró, Spain.",
      "ESP": "TecnoCampus, Mataró, España.",
      "CAT": "TecnoCampus, Mataró, Espanya."
    }
  },
  {
    "lang_key":
    {
      "id":"text27",
      "ENG": "Technological High School",
      "ESP": "Bachillerato Tecnológico",
      "CAT": "Batxillerat Tecnològic"
    }
  },
  {
    "lang_key":
    {
      "id":"text28",
      "ENG": "IES Enric Borras, Badalona, Spain",
      "ESP": "IES Enric Borràs, Badalona, España",
      "CAT": "IES Enric Borràs, Badalona, Espanya"
    }
  },
  {
    "lang_key":
    {
      "id":"text29",
      "ENG": "LANGUAGES",
      "ESP": "IDIOMAS",
      "CAT": "IDIOMES"
    }
  },
  {
    "lang_key":
    {
      "id":"text30",
      "ENG": "Spanish:",
      "ESP": "Español:",
      "CAT": "Espanyol:"
    }
  },
  {
    "lang_key":
    {
      "id":"text31",
      "ENG": "Native",
      "ESP": "Nativo",
      "CAT": "Natiu"
    }
  },
  {
    "lang_key":
    {
      "id":"text32",
      "ENG": "Catalan:",
      "ESP": "Catalán:",
      "CAT": "Català:"
    }
  },
  {
    "lang_key":
    {
      "id":"text33",
      "ENG": "English:",
      "ESP": "Inglés:",
      "CAT": "Anglès:"
    }
  },
  {
    "lang_key":
    {
      "id":"text34",
      "ENG": "B2 Level by TecnoCampus",
      "ESP": "Nivel B2 por TecnoCampus",
      "CAT": "Nivell B2 per TecnoCampus"
    }
  },
  {
    "lang_key":
    {
      "id":"text35",
      "ENG": "CONTACT",
      "ESP": "CONTACTO",
      "CAT": "CONTACTE"
    }
  },
  {
    "lang_key":
    {
      "id":"text36",
      "ENG": "Cv",
      "ESP": "Cv",
      "CAT": "Cv"
    }
  },
  {
    "lang_key":
    {
      "id":"text37",
      "ENG": "Portfolio",
      "ESP": "Portfolio",
      "CAT": "Portafolis"
    }
  },
  {
    "lang_key":
    {
      "id":"text38",
      "ENG": "Download",
      "ESP": "Descargar",
      "CAT": "Descarregar"
    }
  },
  {
    "lang_key":
    {
      "id":"text39",
      "ENG": "Languages",
      "ESP": "Idiomas",
      "CAT": "Idiomes"
    }
  },
  {
    "lang_key":
    {
      "id":"text40",
      "ENG": "Hide",
      "ESP": "Ocultar",
      "CAT": "Amagar"
    }
  },
  {
    "lang_key":
    {
      "id":"text41",
      "ENG": "Ludo - Android Project",
      "ESP": "Parchís - Projecto con Android",
      "CAT": "Parxís - Projecte amb Android"
    }
  },
  {
    "lang_key":
    {
      "id":"text42",
      "ENG": "A project I did in my last year of video game's design and production degree, where I fully developed both the client (Unity & C#) and server (C# & SQLite for the database) of a simple but functional multiplayer Ludo game for Android devices.",
      "ESP": "Un proyecto que realicé en mi último año de la carrera de diseño y producción de videojuegos, donde desarrollé por completo tanto el cliente (Unity & C #) como el servidor (C # & SQLite para la base de datos) de un juego de parchís multijugador simple pero funcional para dispositivos Android.",
      "CAT": "Un projecte que vaig realitzar en el meu últim any de la carrera de disseny i producció de videojocs, on vaig desenvolupar per complet tant el client (Unity & C #) com el servidor (C # & SQLite per a la base de dades) d'un joc de parxís multijugador simple però funcional per a dispositius Android."
    }
  },
  {
    "lang_key":
    {
      "id":"text43",
      "ENG": "\"ROL\" a die - Android project",
      "ESP": "\"ROL\" a die - Projecto con Android",
      "CAT": "\"ROL\" a die - Projecte amb Android"
    }
  },
  {
    "lang_key":
    {
      "id":"text44",
      "ENG": "A small android project made with Unity to test my skills of porting to a mobile device. All assets are borrowed from Unity Asset Store or Google images.",
      "ESP": "Un pequeño proyecto de Android hecho con Unity para poner a prueba mis habilidades de porting a un dispositivo móvil. Todos los assets son prestados de Unity Asset Store o Google Images.",
      "CAT": "Un petit projecte Android realitzat amb Unity per provar les meves habilitats de porting a un dispositiu mòbil. Tots els assets són de préstec de Unity Asset Store o de Google Images."
    }
  },
  {
    "lang_key":
    {
      "id":"text45",
      "ENG": "CODE: \"R0GU3\" - Release Preview",
      "ESP": "CODE: \"R0GU3\" - Release Preview",
      "CAT": "CODE: \"R0GU3\" - Release Preview"
    }
  },
  {
    "lang_key":
    {
      "id":"text46",
      "ENG": "After ten long weeks of development, our team, Stuxnet, finally finished our final year project, << Code: \"R0GU3\" >>, of our third year of career, game design and development at TCM Mataró.\n\nCode: \"R0GU3\" is a stealth game developed in UnrealEngine4 entirely on Blueprint. There is also a short 10 minute demo.\n\nA special thanks to all the teachers who helped us and to my nice fellow Stuxnet colleagues who made those 3 months an incredible experience.",
      "ESP": "Después de diez largas semanas de desarrollo, nuestro equipo, Stuxnet, finalmente terminó nuestro proyecto de último año, << Code: \"R0GU3\" >>, de nuestro tercer año de carrera, diseño y desarrollo de juegos en TCM Mataró.\n\nCode: \"R0GU3\" es un juego de sigilo desarrollado en UnrealEngine4 completamente en Blueprint. También hay una breve demo de 10 minutos.\n\nUn agradecimiento especial a todos los profesores que nos ayudaron y a mis simpáticos compañeros de Stuxnet que hicieron de esos 3 meses una experiencia increíble.",
      "CAT": "Després de deu llargues setmanes de desenvolupament, el nostre equip, Stuxnet, finalment va acabar el nostre projecte d'últim any, << Code: \"R0GU3\" >>, del nostre tercer any de carrera, disseny i desenvolupament de jocs en TCM Mataró.\n\nCode: \"R0GU3\" és un joc de sigil desenvolupat en UnrealEngine4 completament en Blueprint. També hi ha una breu demo de 10 minuts.\n\nUn agraïment especial a tots els professors que ens van ajudar i als meus simpàtics companys de Stuxnet que van fer d'aquests 3 mesos una experiència increïble."
    }
  },
  {
    "lang_key":
    {
      "id":"text47",
      "ENG": "Download the Demo HERE",
      "ESP": "Descarga la Demo AQUI",
      "CAT": "Descarrega la Demo AQUI"
    }
  },
  {
    "lang_key":
    {
      "id":"text48",
      "ENG": "The Continuum's Seal - Release Preview",
      "ESP": "The Continuum's Seal - Release Preview",
      "CAT": "The Continuum's Seal - Release Preview"
    }
  },
  {
    "lang_key":
    {
      "id":"text49",
      "ENG": "Done at the end of my second year of my career in videogame design and production, I worked as a developer using Unity as the game engine and C# as the programming language.\n\nA special thanks to Borja Urquidi for the game design and to Laia Juhé for that great art.",
      "ESP": "Hecho al final de mi segundo año de mi carrera en diseño y producción de videojuegos, trabajé como desarrollador utilizando Unity como motor de juego y C# como lenguaje de programación.\n\nUn agradecimiento especial a Borja Urquidi por el diseño del juego y a Laia Juhé por ese gran arte.",
      "CAT": "Fet a el final del meu segon any de la meva carrera en disseny i producció de videojocs, vaig treballar com a desenvolupador utilitzant Unity com a motor de joc i C# com a llenguatge de programació.\n\nUn agraïment especial a Borja Urquidi pel disseny de el joc ja Laia Juhé pel gran art."
    }
  },
  {
    "lang_key":
    {
      "id":"text50",
      "ENG": "\"Rise of Titans\" is an online multiplayer strategy and card game, with Free-To-Play model monetization, available on Steam and developed by GiantFox.\n\nI started working at GiantFox before finishing my degree in Video Game Design and Production, with an internship contract, which later rose to Junior Developer until I ended up as the main Unity programmer for that project, since I ended up being the only one in charge of developing the videogame.\n\nI spent more than a year working at GiantFox, of which the last six months I was the sole developer of Unity. With my little professional experience, I had to learn to find a way to make the project progress according to what was agreed in the plans. And although it was not in the most optimal way, we all managed to make the game progress properly and meet the requirements to be published on Steam.\n\nThis is the biggest project I have ever worked on and I have learned a lot working on Rise of Titans, both professionally and personally.",
      "ESP": "\"Rise of Titans\" es un juego de cartas y estrategia multijugador online, con monetización de modelo Free-To-Play, disponible en Steam y desarrollado por GiantFox.\n\nEmpecé a trabajar en GiantFox antes de acabar la carrera de Diseño y producción de videojuegos, con un contrato de prácticas, que luego ascendió a Desarrollador Junior hasta acabar como el programador de Unity principal de ese proyecto, ya que acabé siendo el único encargado de desarrollar el videojuego.\n\nEstuve más de un año trabajando en GiantFox, cuyos últimos seis meses fui el único desarrollador de Unity. Con mi poca experiencia profesional, tuve que aprender a encontrar la forma de hacer que el proyecto avanzara de acuerdo a lo acordado en los planes. Y aunque no fue de la forma más óptima, conseguimos entre todos hacer que el videojuego progresara adecuadamente y cumpliera con los requisitos para ser publicado en Steam.\n\nEste es el proyecto más grande en el que he trabajado y he aprendido muchísimo trabajando en Rise of Titans, tanto profesionalmente como personalmente.",
      "CAT": "\"Rise of Titans\" és un joc de cartes i estratègia multijugador en línia, amb monetització de model Free-To-Play, disponible en Steam i desenvolupat per GiantFox.\n\nVaig començar a treballar en GiantFox abans d'acabar la carrera de Disseny i producció de videojocs, amb un contracte de pràctiques, que després va pujar a Desenvolupador Junior fins a acabar com el programador d'Unity principal d'aquest projecte, ja que vaig acabar sent l'únic encarregat de desenvolupar el videojoc.\n\nAquest és el projecte més gran en el que he treballat i he après moltíssim treballant en Rise of Titans, tant professionalment com personalment."
    }
  },
  {
    "lang_key":
    {
      "id":"text51",
      "ENG": "See it on Steam page HERE",
      "ESP": "Verlo en la página de Steam AQUÍ",
      "CAT": "Veure-ho a la pàgina d'Steam AQUÍ"
    }
  }

]
